{
    "channel":"Gives you channel related commands.\n> command: `/help channel`\n",
    "story":"Gives you Story specific commands.\n> command: `/help story`\n",
    "setchannel":"Use this command to tell the bot in which channel the new chapter links and announcements from authors need to be posted.\nIf you mention an existing channel as an option, then the updates will be posted in the mentioned channel.\nIf the option is left empty, a new channel will be created for posting updates.\n\n",
    "setchannelex":"> command: `/setchannel #channel` to set an existing channel, `/setchannel` to create a new channel.\n\n",
    "unsetchannel":"Use this command to stop receiving updates in a channel. You won't be receiving any updates of chapters and announcements if you use this command.\n\n",
    "unsetchannelex":"> command: `/unsetchannel`\n\n",
    "checkchannels":"Use this command to check in which channel the updates are being posted currently.\n\n",
    "checkchannelsex":"> command:`/checkchannels`\n\n",
    "followstory":"Use this command to follow a story, You can follow multiple stories. After following, whenever the author publishes a new chapter in this story, the chapter link will be posted in the server.\n\n",
    "followstoryex":"> command: `/followstory <url of the story>`\n Example: `/followstory https://www.wattpad.com/story/266544533-the-true-elites`\n\n",
    "unfollowstory":"Use this command to unfollow a story. New chapter links will no longer be shared for this story after unfollowing.\n\n",
    "unfollowstoryex":"> command: `/unfollowstory <url of the story>`\n Example: `/unfollowstory https://www.wattpad.com/story/266544533-the-true-elites`\n\n",
    "checkstories":"Use this command to check what stories you're already following.\n\n",
    "checkstoriesex":"> command: `/checkstories`\n\n",
    "followauthor":"Use this command to follow an author. After following, the new announcemnts from this author will be shared in your server.\n\n",
    "followauthorex":"> command: `/folowauthor <url of the author's profile>`\n Example: `/folowauthor https://www.wattpad.com/user/testuserwp`\n\n",
    "unfollowauthor":"Use this command to unfollow an author. After unfollowing, new announcements from this author will no longer be posted.\n\n",
    "unfollowauthorex":"> command: `/unfolowauthor <url of the author's profile>`\n Example: `/unfolowauthor https://www.wattpad.com/user/testuserwp`\n\n",
    "checkauthors":"Use this command to check the author's that you're already following in this server.\n\n",
    "checkauthorsex":"> command: `/checkauthors`\n\n",
    "setcustommsg":"Use this command to set a custom message. Choose the category to specify whether this should be used for story/announcement updates. You can choose an optional parameter `url` and enter the title/full URL of story or author you're following, this will set the custom message only for that particular story/announcement. The Bot will use this message as a title when sharing updates.\n\n",
    "setcustommsgex":"> command: `/setcustommessage <category: story/announcement> <Your custom message> <optional: title/full URL of author/story>`\n\n",
    "removecustommsg":"Use this command to remove the already set custom message. After removing, the bot will use the default title while sharing updates for whole category.\nYou can choose the optional parameter `url` and enter title or URL of the story/author w=for which you want to remove the custom message for. After this the bot will use the default custom msg if that's been setup or default msg while sharing updates.\n\n",
    "removecustommsgex":"> command: `/unsetcustommessage <category: story/announcement> <url:title/URL of the story or author>`\n\n",
    "checkcustommsg":"Use this command to check your current custom messages you've set up.\n\n",
    "checkcustommsgex":"> command: `/checkcustommsg`\n\n",
    "setcustomchannel":"Use this command to set a custom channel. Setting a custom channel will enable to receive updates from different stories and authors in different channels. Choose the channel where you want the updates to show up. Choose the category whether it's story/announcments. And enter the title of the story or name of the author/full URL of the story or author you're already following.\n\n",
    "setcustomchannelex":"> commands: `/set-custom-channel <#channel> <category: story/announcement> <title/URL of the story or author>`\n\n",
    "unsetcustomchannel":"Use this command to remove the alreasy set custom channel for any of the story or server. Choose the channel which you want to remove as a custom channel. Choose the category and enter the title or URL of the story/author you've setup in the custom channel. After unsetting the custom channel, the updates will still be sent if you've setup a common channel for updates\n\n",
    "unsetcustomchannelex":"> commands: `/unset-custom-channel <#channel> <category: story/announcement> <title/URL of the story or author>`\n\n",
    "checkcustomchannels":"Use this comand to check the custom channels you've already setup in your server. this command will give you the list of stories and authors and respective custom channels that's been setup for updates.\n\n",
    "checkcustomchannelsex":"> command: `check-custom-channels <category: story/announcement>`\n\n",
    "setup":"The basic setup required for this bot is specifying the channel in which the bot needs to post the updates. For this use `/setchannel` command.\nYou can either set an existing channel as the place for receiving updates or let the bot create a new channel for you. If you want to set an existing channel, use `/setchannel #channel-name`. If you want to let the bot create a new channel, use `/setchannel`.\nAfter setting up the channel you just need to follow stories and follow authors to get updates.\n\n",
    "setupex":"If you have already set up a channel once but want the bot to send updates to a different channel, you can use `/setchannel #new-channel-name`.\n\n",
    "Note":"set, unset, follow and unfollow commands can be used only by members with ADMINISTRATOR/MODERATE MEMBERS/MANAGE CHANNELS permissions. check commands can be used by anyone.",
    "about":"The Bot can automatically share chapter links of a story whenever a new chapter is published in a story you're following.\nThe Bot can share the whole announcement when an author you're following makes a new announcment.\nYou can follow multiple authors and stories.\n",
    "helpserver":"You can join the support server for any queries or issues you have in using the bot or setting up the bot.\n Invite Link: "
}