{
    "success" : "Success!",
    "error" : "Error!",
    "invalid:url" : "Error. Invalid URL.",
    "unknown:error" : "Unknown error.",
    "empty" : "So Empty!",
    "perms:error" : "Permissions error!",
    "channel:not:set" : "No channel set!",

    "channel:no:read:perms" : "The bot doesn't have the VIEWCHANNEL permissions for the selected channel. Please give the bot VIEWCHANNEL permissions for the channel and try the command again.",
    "channel:no:sendandembed:perms" : "The bot doesn't have the SENDMESSAGES and EMBEDLINKS permissions for the selected channel. Please give the bot SENDMESSAGES and EMBEDLINKS permissions for the channel and try the command again.",
    "channel:no:send:perms" : "The bot doesn't have the SENDMESSAGES permissions for the selected channel. Please give the bot SENDMESSAGES permissions for the channel and try the command again.",
    "channel:no:embed:perms" : "The bot doesn't have the EMBEDLINKS permissions for the selected channel. Please give the bot EMBEDLINKS permissions for the channel and try the command again.",

    "follow:story:success" : "You have succesfully followed this story. The bot will post new chapter updates for this story.",
    "invalid:story:url" : "There is something wrong with the story URL you entered. Please check if this is the correct URL and try again.",
    "already:following:story" : "You're already following this story in this server, no need to follow the same story twice. Use `/check-stories` command to check the stories you're already following.",
    "unknown:error:msg" : "Some unknown error has occured while running this command. Please try using the command again, if the issue still persists contact the dev.",

    "unfollow:story:success" : "You have succesfully unfollowed this story. The bot will not post new chapter updates for this story from now on.",
    "invalid:title" : "There is something wrong with the title you've entered. Please try using the command again with full url.",
    "unfollow:story:not:following" : "You are not following this story in this server. Please use `/check-stories` command to see the stories you're following in this server.",
    "story:multiple:title" : "You are following multiple stories that has this title. Please try the command again with full URL.",
    "author:multiple:title" : "You are following multiple authors that has this title. Please try the command again with full URL.",

    "check:stories:following" : "The stories you're following in this server:",
    "check:stories:empty" : "You're not following any stories in this server currently. Use `/follow-story` command to follow a new story.",

    "follow:author:success" : "You have succesfully followed this author. The bot will post the new announcment updates from this author.",
    "invalid:author:url" : "There is something wrong with the author profile URL you entered. Please check if this is the correct URL and try again.",
    "already:following:author" : "You're already following this author in this server, no need to follow the same author twice. Use `/check-authors` command to check the authors you're already following.",

    "unfollow:author:success" : "You have succesfully unfollowed this author. The bot will not post new announcment updates for this author from now on.",
    "unfollow:author:not:following" : "You are not following this author in this server. Please use `/check-authors` command to see the authors you're following in this server",

    "check:authors:following" : "The authors you're following in this server:",
    "check:authors:empty" : "You're not following any authors in this server currently. Use `/follow-author` command to follow a new author.",

    "channel:unset:success" : "Your channel has been succesfully unset. The bot will not send any updates in this channel from now on.",
    "channel:not:set:msg" : "No channel has been setup for receiving updates in this channel. Use `/set-channel` to configure a channel to receive updates.",

    "check:channels:title" : "The channels that are setup to receive updates from the bot:",
    "check:channels:empty" : "You haven't set up any channels in this server to receive updates from the bot. Use `/set-channel` to set one.",

    "custom:channel:success" : "Custom channel is set succesfully",
    "custom:channel:story:success" : "All the updates from story {0} will be shared in the channel <#{1}> from now on.",
    "custom:channel:author:success" : "All the announcments from author {0} will be shared in the channel <#{1}> from now on.",

    "unset:custom:channel:story:success" : "Channel <#{0}> is removed as custom channel for story {1}.",
    "custom:channel:not:set:story" : "No custom channel has been setup for this story. Use the command `/check-custom-channels` to see the custom channels that are already setup.",
    "unset:custom:channel:author:success" : "Channel <#{0}> is removed as custom channel for announcements from author {1}.",
    "custom:channel:not:set:author" : "No custom channel has been setup for this author's announcements. Use the command `/check-custom-channels` to see the custom channels that are already setup.",

    "custom:channels" : "Your Custom Channels",
    "story:custom:channels" : "Story Custom Channels:",
    "author:custom:channels" : "Author Custom Channels:",
    "custom:channels:not:set" : "No custom channels have been setup in this server yet. Use `/set-custom-channel` command to setup a custom channel.",

    "custom:msg:set:story:success" : "Your custom message for this story has been succesfulyy set. The custom message **{0}** will be used for all the updates from story {1} from now on.",
    "custom:msg:set:author:success" : "Your custom message for this Author's announcements has been succesfulyy set. The custom message **{0}** will be used for all the updates from author {1} from now on.",

    "custom:msg:unset:story:success" : "Your custom message for the story {0} has been deleted. The bot will use the default message while sharing updates for this story from now on.",

    "custom:msgs" : "Your Custom Messages",
    "story:custom:msgs" : "Story Custom Messages:",
    "author:custom:msgs" : "Author Custom Messages:",
    "custom:msgs:not:set" : "No custom Messages have been setup in this server yet. Use `/set-custom-msg` command to set a new custom message.",

    "new:chapter:msg" : "**New chapter from {0}**",
    "new:announcement:msg" : "**New announcement from {0}**"

}